app/views/coaches/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."coach_id" = ?  [["coach_id", 1]]
---
        <h4>＜コメント一覧＞</h4>
          <% @coach.comments.each do |comment| %>