app/controllers/coaches_controller.rb

  def index
    @coaches = Coach.order("created_at DESC")
---
SELECT "coaches".* FROM "coaches" ORDER BY created_at DESC

  def create
    @coach = Coach.new(coach_params)
    if @coach.save
---
INSERT INTO "coaches" ("user_id", "rank_id", "kill_rate", "character", "play_style", "play_time", "play_device", "communication_tool", "price", "times_to_teach", "rank_limit_id", "appeal_point", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @comments = @coach.comments.includes(:user)
---
SELECT "comments".* FROM "comments" WHERE "comments"."coach_id" = ?  [["coach_id", 1]]

  def destroy
    if @coach.user_id == current_user.id
      @coach.destroy
---
DELETE FROM "coaches" WHERE "coaches"."id" = ?  [["id", 1]]

  def set_coach
    @coach = Coach.find(params[:id])
---
SELECT "coaches".* FROM "coaches" WHERE "coaches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]