app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @coach = Coach.find(params[:coach_id])
    if @comment.save
---
SELECT "coaches".* FROM "coaches" WHERE "coaches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("text", "user_id", "coach_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "気合十分です"], ["user_id", 2], ["coach_id", 1], ["created_at", "2024-01-30 02:54:05.960849"], ["updated_at", "2024-01-30 02:54:05.960849"]]