app/controllers/orders_controller.rb

  def non_matched_coach
    @coach = Coach.find(params[:coach_id])
---
SELECT "coaches".* FROM "coaches" WHERE "coaches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]