app/controllers/students_controller.rb

SELECT "students".* FROM "students" ORDER BY created_at DESC
---
  def index
    @students = Student.order("created_at DESC")

INSERT INTO "students" ("user_id", "rank_id", "kill_rate", "character", "play_style", "play_time", "play_device", "communication_tool", "price", "times_to_teach", "enthusiasm_text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @student = Student.new(student_params)
    if @student.save